# IsWithFitting Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTrayConduitBase..::..IsWithFitting Method
CableTrayConduitBase Class See Also
---
Return whether its cable tray/conduit type is with fitting
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsWithFitting()
```

Visual Basic
---
```text
Public Function IsWithFitting As Boolean
```

Visual C++
---
```text
public:
bool IsWithFitting()
```

# ### Return Value
return true if its type is with fitting type.
# See Also
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace